Revit 2027 API
InternalDefinition.GetParameterTypeId Method
 Tests whether this definition identifies a built-in parameter or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ForgeTypeId GetParameterTypeId()
Public Function GetParameterTypeId As ForgeTypeId
public:
ForgeTypeId^ GetParameterTypeId()
member GetParameterTypeId : unit -> ForgeTypeId
Return Value
ForgeTypeId
Remarks
 For a built-in parameter this method returns one of the ParameterTypeId static properties. For custom-defined parameters, such as shared, global, or family parameters the value is null.
See Also
Reference
InternalDefinition Class
Autodesk.Revit.DB Namespace